export const menuDictionary = {
  ADD_PROXY: "Додати проксі",
  MAIN_MENU: "Головне меню:",
  PROXY_LIST: "Список проксі",
  SETTINGS: "Налаштування",
  PENDING_TRANSACTIONS: "Відкриті заявки",
};

export const proxyListMenu = {
  EDIT: "Редагувати",
  REMOVE: "Видалити",
  EDIT_LOGIN: "Логін",
  EDIT_PASSWORD: "Пароль",
  EDIT_ADDRESS: "Адресу",
  INFO: "",
};

export const transactionListMenu = {
  APPROVE: "Прийняти",
  DECLINE: "Відхилити",
  INFO: "Інфо",
};

export const userMenuDictionary = {
  RENT: "Оренда проксі",
  HISTORY: "Історія",
  SETTINGS: "Налаштування",
  FREE: "🌐 Наразі в нас доступні такі проксі:",
};

export const settingsMenuDictionary = {
  MONOBANK_SETTINGS: "Монобанк",
  TRUST_SETTINGS: "Trust",
  ADD_NEW_ADMIN: "Додати адміна",
};

export const rentMenuDictionary = {
  RENT_TIME: "rentTime",
  RENT_ADDRESS: "rAddress",
  BINANCE: "💰 Binance",
  MONOBANK: "🏦 Monobank",
  PAID: "paid",
  HOW_LONG: "⏳ На скільки часу ви хочете орендувати проксі?",
  TIME_1: "🔹 30 хв. - 0.5 usd",
  TIME_2: "🔹 1 год. - 1 usd",
  TIME_3: "🔹 12 год. - 7 usd",
  TIME_4: "🔹 24 год. - 24 usd",
  TIME_5: "🔹 3 дні - 50 usd",
  TIME_6: "🔹 7 днів - 100 usd",
  TIME_7: "🔹 30 днів - 200 usd",
  YES: "✅ Так",
  NO: "❌ Ні",
  PAY_METHOD: "💳 Будь ласка, оберіть бажаний метод оплати:",
  PAYED: "✅ Сплатив",
  ATTACHED: "📎 Прикріпіть, будь ласка, скрін проплати",
  ATTACHED_SUCCESS:
    "Дякуємо за наданий скріншот оплати. \nВашу заявку успішно отримано та вона наразі знаходиться в процесі обробки.",
};

export const userHistoryMenu = {
  EMPTY: "Ви ще не орендували жодного проксі.",
  HISTORY_HEADER: "📜 Останні проксі які ви орендували",
  ERROR: "😔 Виникла помилка при отриманні історії.",
  TIME_1: "30 хв.",
  TIME_2: "1 год.",
  TIME_3: "12 год.",
  TIME_4: "24 год.",
  TIME_5: "3 дні",
  TIME_6: "7 днів",
  TIME_7: "30 днів",
  PROXY: "🖥️ Проксі:",
  RENT_TIME: "⏳ Час оренди:",
  STATUS: "📄 Статус:",
  PRICE: "💵 Вартість:",
  PHOTO: "🖼️ Фото оплати:",
  PHOTO_NOT_FOUND: "Відсутнє",
  ERROR_HISTORY: "😔 Виникла помилка при отриманні деталей транзакції.",
};
